class AntiqueInfo {
  final String title;
  final String youtubeURL;
  final List<String> imgsPath;
  final String content;
  static const t = 'r';

  AntiqueInfo(
    this.title,
    this.youtubeURL,
    this.imgsPath,
    this.content,
  );
}

class AppData {
  static final antiques = <AntiqueInfo>[
    AntiqueInfo('توت عنخ امون', 'https://www.youtube.com/watch?v=buZ5EApEKxo', [
      'assets/images/King_Tut_Burial_Mask.jpg',
      'assets/images/t1.jpg',
      'assets/images/Tutankhamun-Egypt-Tours-Portal.jpg',
    ], ''' توت عنخ آمون هو أحد فراعنة الأسرة المصرية الثامنة عشر في تاريخ مصر القديم، وكان فرعون مصر من 1334 ق.م إلى 1325 ق.م. يعدّ توت عنخ آمون من أشهر الفراعنة لأسباب لا تتعلق بإنجازات حققّها أو حروب انتصر فيها كما هو الحال مع الكثير من الفراعنة؛ وإنما لأسباب أخرى تعدّ مهمة من الناحية التاريخية ومن أبرزها هو اكتشاف مقبرته وكنوزه بالكامل دون أي تلف. واللغز الذي أحاط بظروف وفاته إذ اعتبر الكثير وفاة فرعون في سن مبكرة جدًا أمرًا غير طبيعي وخاصة مع وجود آثار لكسور في عظمي الفخذ و‌الجمجمة، وزواج وزيره من أرملته من بعد وفاته وتنصيب نفسه فرعونًا. كل هذه الأحداث الغامضة، والاستعمال الكثيف لأسطورة لعنة الفراعنة المرتبطة بمقبرة توت عنخ أمون التي استخدمت في الأفلام وألعاب الفيديو جعلت من توت عنخ آمون أشهر الفراعنة لألغاز وأسئلة لا تزال بلا جواب، اعتبرها البعض من أقدم الاغتيالات في تاريخ الإنسانية. توفي توت عنخ أمون صغير السن ودفن في مقبرته -مقبرة 62 - في وادي الملوك.
كان توت عنخ أمون بعمر التاسعة عندما أصبح فرعون مصر واسمه باللغة المصرية القديمة تعني "الصورة الحية للإله آمون"، كبير الآلهة المصرية القديمة. عاش توت عنخ آمون في فترة انتقالية في تاريخ مصر القديمة حيث أتى بعد إخناتون الذي حاول توحيد آلهة مصر القديمة في شكل الإله الواحد الأحد. وتم في عهده العودة إلى عبادة آلهة مصر القديمة المتعددة. تم اكتشاف قبره عام 1922 في وادي الملوك من قبل عالم الآثار البريطاني هوارد كارتر. وأحدث هذا الاكتشاف ضجة إعلامية واسعة النطاق في العالم.'''),
    AntiqueInfo('كيلوباترا', 'https://www.youtube.com/watch?v=Xy__qnbqGZs', [
      'assets/images/k2.jpg',
      'assets/images/killobatra.jpg',
      'assets/images/k3.jpg',
    ], '''الملكة كليوباترا السابعة والمعروفة باسم كليوباترا هي آخر ملوك الأسرة المقدونية، التي حكمت مصر منذ وفاة الإسكندر الأكبر في عام 323 قبل الميلاد، وحتى احتلال مصر من قِبَل روما عام 30 قبل الميلاد.

جزء من سلسلة مقالات حول
روما القديمة وسقوط الجمهورية

شخصيات
مارك أنطونيكليوباترابومبيوسسكستوس بومبيوسشيشرونبروتسكراسوس
أحداث
اغتيال يوليوس قيصرالحكم الثلاثي الأولالحكم الثلاثي الثانيحرب قيصر الأهليةاغتيال يوليوس قيصرالتمرد الصقليحرب المحررين الأهليةالحرب الأخيرة
مواقع
قيصرية الإسكندريةكوميتيوم كوريا جوليا كوريا هوستيليا روسترا مسرح بومبيوس 
شعار بوابة
بوابة روما القديمة
عنت
كانت كليوباترا ابنة بطليموس الثاني عشر . وقد خلفته كملكة سنة 51 ق.م مشاطرة العرش أخاها بطليموس الثالث عشر . وقد وصُفـت بأنها كانت جميلة وساحرة. على نقيض ماتبرزها الصور التي وصلت إلينا. أما الرجال الذين وقعوا في غرامها فقد أسرتهم بشخصيتها القوية الظريفة وبذكائها ودهائها.

وكانت دائمة النزاع مع شقيقها الذي انتهى بطردها من مصر . وكانت البلاد في ذلك الوقت مملكة تحت الحماية الرومانية ، والمصدر الرئيسي للقمح بالنسبة للشعب الروماني. وأقبل قيصر إلى مصر عقب هزيمة بومبيوس في فارسالوس سنة 48 ق.م، فوجد الحـرب الأهلية ماتزال قائمة فيها. وكانت كليوباترا تحاول العودة إلى مصر ، فعمدت إلى الظهور فجأة أمام قيصر ملفوفة في سجادة - كما يزعمون - بحيث تستطيع التوسل إليه لمساعدتها في تحقيق غايتها للعودة إلى الحكم. وقد أسرته، إما بمفاتنها، أو بالمنطق الجلي بأنها ستكون حاكماً أفضل من شقيقها. وساعدها قيصر على التغلب على بطليموس الذي أغرق في نهاية المعركة.

وحكمت كليوباترا بضع سنوات. وفي سنة 40 ق. م كانت مملكتها جزءاً من نصيب الإمبراطوري الذي أصاب ماركوس انطونيوس عندما اقتسـم العالم الروماني مع كل من اوكتافيوس و ماركوس ليبيدوس بعد مصـرع يوليوس قيصر. وقد أحب ماركوس أنطونيوس كليوباترا، وكلّفته علاقته الغرامية هذه فقدان حظوته في روما .

وانتهى أمر أنطونيوس بالانتحار إثر الهزيمة التي أنزلها به أوكتافيوس في معركة أكتيوم سنة 31 ق.م. فلما سمعت كليوباترا بالنبأ انتحـرت هي الأخرى.'''),
    AntiqueInfo(
        'الكاتب الجالس', 'https://www.youtube.com/watch?v=YBwxhsT7a0A', [
      'assets/images/kateb.jpg',
      'assets/images/kateb2.jpg',
      'assets/images/Seated_scribe.jpg',
    ], ''' اعتمدت حضارة مصر القديمة على الاداريين أكثر من المحاربين و قد أعطت الكثير من الاهتمام للكاتب للمصرى على مدى العصور و خاصة فى اعصر الدولة القديمة. أما الفلاح و المزارعين كان أكثر أهميه فى عصر الدولة الوسطى و زادت اهمية الجنود المحاربين و مكانتهم فى عصر الدولة الحديثة.
يعود تمثال الكاتب المصرى أو الكاتب الجالس القرفصاء الى بداية الاسرة الخامسة و هو من القطع الاصليه و قد عثر عليه فى جبانة سقارة بمحافظة الجيزة. و هو عبارة عن كتلة واحدة من الحجر الجيرى و هو نوع شهير من الاحجار كانت تأتى من منطقة المعصرة حاليا و طرة و جبل المقطم بالقاهرة.
'''),
  ];
}
